src_doc/InformationRegisters/СоответствиеВидовРаспознаваемыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеВидовРаспознаваемыхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тематика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипФормализованногоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФормализованныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/СоответствиеВидовРаспознаваемыхДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Записать данные.
// 
// Параметры:
//  СоответствиеВидовДокументов - ТаблицаЗначений
Процедура ЗаписатьДанные(СоответствиеВидовДокументов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Набор = СоздатьНаборЗаписей();
	Набор.Загрузить(СоответствиеВидовДокументов);
	Набор.Записать(Истина);
	
КонецПроцедуры

// Соответствие видов распознаваемых документов.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Соответствие видов распознаваемых документов:
//   * ТипФормализованногоДокумента - ПеречислениеСсылка.ТипыФормализованныхДокументов
//   * ВидДокумента - СправочникСсылка.ВидыДокументов
//   * Тематика - СправочникСсылка.ТематикиДокументов
//   * Шаблон - СправочникСсылка.ШаблоныДокументов
Функция СоответствиеВидовРаспознаваемыхДокументов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СоответствиеВидовРаспознаваемыхДокументов.ТипФормализованногоДокумента КАК ТипФормализованногоДокумента,
	|	СоответствиеВидовРаспознаваемыхДокументов.ВидДокумента КАК ВидДокумента,
	|	СоответствиеВидовРаспознаваемыхДокументов.Тематика КАК Тематика,
	|	СоответствиеВидовРаспознаваемыхДокументов.Шаблон КАК Шаблон
	|ИЗ
	|	РегистрСведений.СоответствиеВидовРаспознаваемыхДокументов КАК СоответствиеВидовРаспознаваемыхДокументов");
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
#КонецОбласти

#КонецЕсли
